#include <xc.h> // include processor files - each processor file is guarded.  
#include <stdbool.h>
#include <stdint.h>
#include "TMRx.h"
//----------------------------------------------------------------------
//тактовая 16мгц (шина 4мгц)
// TMR0 - 50 микросекунд (шаг интервала разрешения коллизий доступа к шине)
// TMR1 -  100 миллисекунд (период софттаймера приложений)
// TMR2 - 10 миллисекунд (период софттаймеров работы с кнопками)
// TMR4 - 1 миллисекунда (период коммуникационного софттаймера)
// TMR6 - PWM 
//----------------------------------------------------------------------
// TMR1 -  100 миллисекунд 
// предделитель - 8
// делитель - 50000 (0xC350) регистр(дополнение до 0xFFFF) ->0x3CAF
// 4мгц / 8 = 500000, 500000 / 50000 = 10 
// итого 1/10 = 100 миллисек
//----------------------------------------------------------------------
// TMR2 -  10 миллисекунд 
// предделитель - 16
// делитель - 250 (0xFA)  регистр(дополнение до 0xFF) ->0x05
// постделитель - 10 (0x0A)
// 4мгц/16 = 250000, 125000/250 = 1000 1000/10 =100
// итого 1/100 = 10 миллисек
//----------------------------------------------------------------------
// TMR4 -  1 миллисекунда 
// предделитель - 16
// делитель - 250 (0xFA)  регистр(дополнение до 0xFF) ->0x05
// постделитель - 10 (0x0A)
// 4мгц/16 = 250000, 125000/250 = 1000 1000/10 =1000
// итого 1/1000 = 1 миллисек
//----------------------------------------------------------------------
// TMR6 -  1 миллисекунда 
// аналогично TMR4

void initTMR0(void)
{
	//init_TMR0
	// PSA assigned; PS 1:16; TMRSE Increment_hi_lo; mask the nWPUEN and INTEDG bits
	// nWPUEN = 1 INTEDG = 0 TMRCS = 0 TMRSE = x  PSA = 0x03
	OPTION_REG = (uint8_t) ((OPTION_REG & 0x83)|(0x80|0x03));
	TMR0 = _TMR0; // 0xCE дополнение к 49 до 255
	
	//OSC = 16 000 000; тактирование Fosc/4 = 16000000/4 = 4 000 000
	//Прескалер 1:4, (Fosc/4 ) / 4 = 4 000 000/16 = 250 000
	//FF-CE = 31(49dec)один тик 250 000 гц -> 4 мкс *49 = 196 (200)мкс (us)
	//FF-90 = 6F (111) один тик 250 000 гц -> 4 мкс 111 = 444 (500)мкс (us)
	

}
//------------------------------------------------------------------------------

void initTMR1(void)
{
	//init_TMR1
	//T1GSS T1G_pin; TMR1GE disabled; T1GTM disabled; T1GPOL low; T1GGO done; T1GSPM disabled; 
	T1GCON = 0x00;
	CCP1CON = 0x00;
	////!!!!!!!!!!!!!!!!!!!!!!!!!! pic16F1824 разремить !!
	CCP2CON = 0x00;
	TMR1H = _TMR1H; //0xF8 см.ISR();
	TMR1L = _TMR1L; //0x30 см.ISR();
	// T1CKPS 1:8; T1OSCEN disabled; nT1SYNC synchronize; TMR1CS FOSC/4; TMR1ON disabled; 
	T1CON = 0x30;
	//Устанавливаем приориет прерывания   
	//   IPR1bits.TMR1IP = 1; //HI priority
}
//------------------------------------------------------------------------------
//постделитель 10 ->0(100 1)000
#define T2OUTPS 0x48 // 0100 1000
//предделитель 16-> 0000 00(10)
#define T2CKPS  0x02 // 0000 0010

void initTMR2(void)
{
	T2CON = T2OUTPS | T2CKPS;
	TMR2 = _TMR2;
}
//------------------------------------------------------------------------------
//постделитель 1 ->0(000 0)000
#define T4OUTPS 0x00 // 0000 0000
//предделитель 16-> 0000 00(10)
#define T4CKPS  0x02 // 0000 0010

void initTMR4(void)
{
	T4CON = T4OUTPS | T4CKPS;
	TMR4 = _TMR4;
}
//------------------------------------------------------------------------------
//постделитель 1 ->0(000 0)000
#define T6OUTPS 0x00 // 0000 0000
//предделитель 16-> 0000 00(10)
#define T6CKPS  0x02 // 0000 0010

void initTMR6(void) {
    // TOUTPS 1:1; TMRON on; TCKPS 1:16; 
 	T6CON = T6OUTPS | T6CKPS;
    // PR 200 
    PR6 = 0xFA;
    // TMR 0x0; 
    TMR6 = 0x0;
}
//------------------------------------------------------------------------------

void initTMRx(void)
{
	initTMR0();
	initTMR1();
	initTMR2();
	initTMR4();
	initTMR6();
}

void startTMRx(void)
{
	//Разрешаем прерывание от Таймера 0
	INTCONbits.TMR0IF = 0;
	INTCONbits.TMR0IE = 1;
	//Разрешаем прерывание от Таймера 1
	PIR1bits.TMR1IF = 0;
	PIE1bits.TMR1IE = 1;
	//Разрешаем прерывание от Таймера 2
	PIR1bits.TMR2IF = 0;
	PIE1bits.TMR2IE = 1;
	//Разрешаем прерывание от Таймера 4
	PIR3bits.TMR4IF = 0;
	PIE3bits.TMR4IE = 1;
	//Очищаем прерывание от Таймера 6
	PIR3bits.TMR6IF = 0;

	TMR1ON = 1;
	TMR2ON = 1;
	TMR4ON = 1;
	TMR6ON = 1;
}
